program main 
real x1,x2,x3,x4,x5,x,y1,y2,y3,y4,y5,a
integer a100
!輸入變數
x1=0.3
x2=0.5
x3=0.7
x4=0.9
x5=1.1
y1=0.404958
y2=0.824361
y3=1.40963
y4=2.21364
y5=3.30458

write(*,*)"**x******f(x)*********"

Do a100=0,150,1
x=a100/100.

a=(x-x1)*(x-x2)*(x-x3)*(x-x4)/((x5-x1)*(x5-x2)*(x5-x3)*(x5-x4))*y5 &
+(x-x1)*(x-x2)*(x-x3)*(x-x5)/((x4-x1)*(x4-x2)*(x4-x3)*(x4-x5))*y4 &
+(x-x1)*(x-x2)*(x-x5)*(x-x4)/((x3-x1)*(x3-x2)*(x3-x5)*(x3-x4))*y3 &
+(x-x1)*(x-x5)*(x-x3)*(x-x4)/((x2-x1)*(x2-x5)*(x2-x3)*(x2-x4))*y2 &
+(x-x5)*(x-x2)*(x-x3)*(x-x4)/((x1-x5)*(x1-x2)*(x1-x3)*(x1-x4))*y1


write(*,'(1x,f5.2)',advance='no') x
write(*,'(f10.5)') a

end do
end
